{
  "welcomeMessage": "Welcome to SNJB COE Assistant! I'm here to help you with anything related to the college. Ask about admissions, departments, placements, campus life, or more.",
  "greetings": {
    "hi": "Hello! 👋 How can I assist you today about SNJB College of Engineering?",
    "hello": "Hi there! 😊 Need any information related to SNJB COE?",
    "hey": "Hey! Ask me anything about the college, from courses to placements.",
    "good morning": "Good morning! 🌅 Ready to explore what SNJB COE offers?",
    "good evening": "Good evening! 🌇 Feel free to ask about academics, clubs, or anything else."
  },
  "suggestedTopics": [
    "Admissions",
    "Programs",
    "Departments",
    "Placements",
    "Facilities",
    "Hostel",
    "Vision",
    "Clubs",
    "Achievements",
    "Contact"
  ],
  "topicsInfo": {
    "admissions": "Admissions at SNJB COE are through DTE Maharashtra CAP. 1st year requires 12th Science PCM + MHT-CET/JEE. Direct 2nd year needs Diploma with 45% (General) or 40% (Reserved).",
    "programs": "UG: Civil, Computer, Mechanical, E&TC, AI & DS. PG: MBA, M.Tech (Computer Engg). First year is common.",
    "departments": "Departments include Civil, Computer, Mechanical, E&TC, AI & DS, and MBA, each led by experienced faculty.",
    "placements": "Top recruiters: TCS, Infosys, Wipro. Highest package: ₹10 LPA. Average: ₹3.2 LPA. Includes training, internships, and mock interviews.",
    "facilities": "Smart classrooms, labs, library, auditorium, hostel, WiFi, canteen, ATM, gym, medical, transport, and sports complex.",
    "hostel": "Separate hostels for boys & girls with mess, Wi-Fi, 24/7 security, medical facilities, gym, and clean rooms.",
    "vision": "To transform learners through quality technical education for creativity, professionalism, and societal growth.",
    "clubs": "Join Coding Club, Robotics Club, Entrepreneurship Cell, NSS, Cultural Club, and Sustainability Cell.",
    "achievements": "NAAC A+ (2023), NBA Accreditation, Best Rural Engineering College, AICTE-CII Innovation Award.",
    "contact": "📞 +91-2556-253750, ✉️ principalcoe@snjb.org, 🌐 https://www.snjb.org/engineering/Home"
  },
  "defaultResponse": "Sorry, I didn't understand that. Try asking about admissions, placements, programs, hostel, or contact info."
}
